/*
Разработать слоедующую иерархию школьников:
1. Младшеклассник
2. Ученик средней школы
3. Старшеклассник
Все школьники должны обладать методом учиться. У младшеклассника релизовать следующие методы:
1. Учиться, выдающий на экран фразу "Я люблю учиться"
2. Играть, выводящий на экран фрацу "Я играю в игрушки"
У ученика средней школы реализовать следующие методы:
1. Учиться, выводящий на экран фразу "Я ненавижу учиться"
2. Играть, выводящий на экран фрацу "Я играю в Minecraft"
3. Прогуливать уроки, выводящий на экран фразу "Я прогуливаю уроки"
Для старшеклассника реализовать следующие методы:
1. Учиться, выводящий на экран фрацу "Я должен учиться"
2. Курить, выводящий на экран фрацу "Я курю"
 */

package Seminars.S3T1School;

public class Program {


    public static void main(String[] args) {

    }
}
